20201226211105-scheme.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-04 Thu 10:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Scheme</title>
<meta name="generator" content="Org mode">
<link rel="shortcut icon" href="/wiki/static/img/favicon.ico">
<link rel="preconnect" href="https://fonts.gstatic.com">
<link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&family=JetBrains+Mono&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/wiki/static/css/style.css">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Scheme</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge85add4">1. Notes</a>
<ul>
<li><a href="#org0b96121">1.1. How to load <code>libgsl.so</code> in Chez Scheme</a></li>
<li><a href="#org54f07d4">1.2. Use Rust to make a “bridging” library for (Chez) Scheme?</a></li>
<li><a href="#orgc1e7101">1.3. Chez Scheme Community</a></li>
<li><a href="#org8852729">1.4. Port <code>sllgen</code> to R6RS?</a></li>
<li><a href="#org39f013c">1.5. Make GMP work in Chez Scheme?</a></li>
</ul>
</li>
<li><a href="#org975f58b">2. Resources</a>
<ul>
<li><a href="#orge18dc1f">2.1. Articles</a></li>
<li><a href="#org446fae6">2.2. Papers</a></li>
<li><a href="#org3224f39">2.3. Libraries</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Scheme is a <b>minimalist dialect</b> of the <a href="20201225161334-lisp.html">Lisp</a> family of programming languages. Scheme consists of a small standard core with several tools for language extension.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="font-weight: bold;">define</span> <span style="font-weight: bold;">hello-world</span> ()
  (display <span style="font-style: italic;">"Hello, World"</span>)
  (newline))
</pre>
</div>

<div id="outline-container-orge85add4" class="outline-2">
<h2 id="orge85add4"><span class="section-number-2">1</span> Notes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0b96121" class="outline-3">
<h3 id="org0b96121"><span class="section-number-3">1.1</span> How to load <code>libgsl.so</code> in Chez Scheme</h3>
<div class="outline-text-3" id="text-1-1">
<p>
See <a href="https://github.com/cisco/ChezScheme/issues/311">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">LD_PRELOAD</span>=<span style="font-style: italic;">"libgslcblas.so libgsl.so"</span> scheme
</pre>
</div>
</div>
</div>

<div id="outline-container-org54f07d4" class="outline-3">
<h3 id="org54f07d4"><span class="section-number-3">1.2</span> Use <a href="20201227155151-rust.html">Rust</a> to make a “bridging” library for (Chez) Scheme?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Go
<ul class="org-ul">
<li><a href="https://github.com/go-interpreter/chezgo">chezgo</a></li>
</ul></li>
<li>Python
<ul class="org-ul">
<li><a href="https://pyo3.rs/v0.13.0/">pyo3</a></li>
<li><a href="https://github.com/indygreg/PyOxidizer">PyOxidizer</a></li>
</ul></li>
<li>Node.js
<ul class="org-ul">
<li><a href="https://neon-bindings.com/">neon</a></li>
</ul></li>
<li>Ruby
<ul class="org-ul">
<li><a href="https://github.com/d-unseductable/ruru">ruru</a></li>
<li><a href="https://github.com/danielpclark/rutie">rutie</a></li>
<li><a href="https://deliveroo.engineering/2019/02/14/moving-from-ruby-to-rust.html">Moving from Ruby to Rust</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1e7101" class="outline-3">
<h3 id="orgc1e7101"><span class="section-number-3">1.3</span> Chez Scheme Community</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://github.com/cisco/ChezScheme/issues/5">IRC Chatroom</a></li>
<li><a href="https://github.com/cisco/ChezScheme/issues">Github Issues</a></li>
<li><a href="https://groups.google.com/forum/#!forum/chez-scheme">Google Groups (Mailing list)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8852729" class="outline-3">
<h3 id="org8852729"><span class="section-number-3">1.4</span> Port <code>sllgen</code> to R6RS?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>sllgen</code>: Scheme LL(1) parser generator, used by <a href="20201227150000-essentials_of_programming_languages.html">EOPL</a>.
</p>

<p>
<a href="https://github.com/chenyukang/eopl/blob/master/libs/sllgen.scm">source code</a>
</p>
</div>
</div>

<div id="outline-container-org39f013c" class="outline-3">
<h3 id="org39f013c"><span class="section-number-3">1.5</span> Make GMP work in Chez Scheme?</h3>
<div class="outline-text-3" id="text-1-5">
<p>
As discussed in this <a href="https://github.com/cisco/ChezScheme/issues/14">issue: Poor performance when dealing with multi-precision numbers</a>, Dybvig <a href="https://github.com/cisco/ChezScheme/issues/14#issuecomment-215066762">wrote</a>:
</p>

<blockquote>
<p>
I'm actually happy to see issues related to performance. Good performance is, after all, one of our primary goals. It's true that a thorough comparison would involve a lot more and more careful benchmarking, but it's nice to have examples where we aren't doing as well as we could, especially if it motivates contributors to submit fixes.
</p>

<p>
Using gmp would indeed speed up programs that operate on large numbers, particularly programs that multiply and divide very large numbers. Licensing is the primary issue blocking us from using it. Another is that our own, different representation of bignums is baked into the compiler and run-time system in a couple of ways.
</p>
</blockquote>

<p>
It'd be great to bring GMP integration to Chez.
</p>

<ul class="org-ul">
<li><a href="https://gmplib.org/manual">GNU MP Manual</a></li>
<li><a href="https://github.com/rmculpepper/racket-gmp">racket-gmp</a></li>
<li><a href="https://www.cs.colorado.edu/~srirams/courses/csci2824-spr14/gmpTutorial.html">Tutorial on GMP</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org975f58b" class="outline-2">
<h2 id="org975f58b"><span class="section-number-2">2</span> Resources</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/johnwcowan/r7rs-work/blob/master/R7RSHomePage.md">R7RS Home Page</a>
<ul class="org-ul">
<li><a href="https://small.r7rs.org/">R7RS (Small)</a>
<ul class="org-ul">
<li><a href="https://small.r7rs.org/attachment/r7rs.pdf">PDF</a></li>
</ul></li>
</ul></li>
<li><a href="http://www.r6rs.org/">R6RS Home Page</a></li>
<li><a href="https://cisco.github.io/ChezScheme/csug9.5/csug.html">Chez Scheme User's Guide</a></li>
<li><a href="https://www.scheme.com/tspl4/">The Scheme Programming Language, 4th Edition</a></li>
<li><a href="https://ecraven.github.io/r7rs-benchmarks/">Scheme Benchmarks</a></li>
<li><a href="https://github.com/lambdaconservatory/scheme-release-archive">scheme-release-archive</a>
<ul class="org-ul">
<li>Source releases of old or obscure Scheme implementations</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orge18dc1f" class="outline-3">
<h3 id="orge18dc1f"><span class="section-number-3">2.1</span> Articles</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://scheme.com/debug/debug.html">How to Debug Chez Scheme Programs</a></li>
<li><a href="https://www.yinwang.org/blog-cn/2013/04/11/scheme-setup">Scheme 编程环境的设置</a></li>
<li><a href="https://www.yinwang.org/blog-cn/2013/03/28/chez-scheme">Chez Scheme 的传说</a></li>
<li><a href="https://programmingpraxis.com/2017/10/03/chez-scheme-setup/">Chez Scheme Setup</a></li>
<li><a href="http://fmnt.info/blog/20181029_scheme.html">Scheme for scientific computing</a></li>
<li><a href="https://news.ycombinator.com/item?id=16406391">Chez is not JITted. Chez compiles to native binaries that run win the chez runtime (so not stand-alone).</a></li>
<li><a href="http://matt.might.net/articles/programming-with-continuations--exceptions-backtracking-search-threads-generators-coroutines/">Continuations by example: Exceptions, time-traveling search, generators, threads, and coroutines</a></li>
<li><a href="https://weinholt.se/articles/r7rs-vs-r6rs/">R7RS versus R6RS</a></li>
<li><a href="https://hipster.home.xs4all.nl/lib/scheme/gauche/define-syntax-primer.txt?repost=repost">JRM's Syntax-rules Primer for the Merely Eccentric</a></li>
<li><a href="https://web.archive.org/web/20200206200543/http://www.willdonnelly.net/blog/scheme-syntax-rules/">A Scheme Syntax-Rules Primer</a></li>
<li><a href="https://web.archive.org/web/20181006202112/https://www.cs.indiana.edu/chezscheme/match/">Using Match</a>
<ul class="org-ul">
<li>describes a pattern matcher, unimaginatively called <code>match</code></li>
<li>original source code available at <a href="https://web.archive.org/web/20160826073216/http://www.cs.indiana.edu/chezscheme/match/match.ss">here</a></li>
</ul></li>
<li><a href="https://wespiser.com/writings/wyas/home.html">Write You A Scheme, Version 2</a></li>
<li><a href="20201227164302-f.html#org2e10530">Write Yourself a Scheme in 48 Hours in F#</a></li>
</ul>
</div>
</div>

<div id="outline-container-org446fae6" class="outline-3">
<h3 id="org446fae6"><span class="section-number-3">2.2</span> Papers</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://www-sop.inria.fr/members/Manuel.Serrano/publi/jot04/jot04.html">Bigloo.NET: compiling Scheme to .NET CLR</a>
<ul class="org-ul">
<li><a href="20201227163827-net.html">.NET</a></li>
</ul></li>
<li><a href="https://dl.acm.org/doi/10.1145/583852.581503">Compiling scheme to JVM bytecode:: a performance study</a></li>
<li><a href="https://guenchi.github.io/Scheme">Scheme Related Papers</a>
<ul class="org-ul">
<li>A list of papers related to Scheme, indexed alphabetically</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3224f39" class="outline-3">
<h3 id="org3224f39"><span class="section-number-3">2.3</span> Libraries</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://srfi.schemers.org/">SRFIs</a></li>
<li><a href="https://github.com/ovenpasta/thunderchez">Thunderchez</a></li>
<li><a href="https://github.com/macdavid313/chezure">Chezure</a></li>
<li><a href="https://github.com/becls/swish">Swish</a></li>
<li><a href="https://github.com/dybvig/stex">stex</a></li>
<li><a href="https://github.com/nanopass/nanopass-framework-scheme">nanopass</a></li>
<li><a href="https://github.com/macdavid313/define-datatype">define-datatype</a>
<ul class="org-ul">
<li>port of <code>define-datatype</code> from <a href="20201227150000-essentials_of_programming_languages.html">EOPL</a></li>
</ul></li>
<li><a href="https://github.com/macdavid313/chez-string-metrics">chez-string-metrics</a>
<ul class="org-ul">
<li>various string metrics efficiently in Chez Scheme, e.g. Levenshtein</li>
</ul></li>
<li><a href="https://github.com/macdavid313/chez-finalize">chez-finalize</a></li>
<li><a href="https://github.com/gwatt/chez-exe">chez-exe</a>
<ul class="org-ul">
<li>Chez Scheme self hosting executable</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script type="text/javascript" src="/wiki/static/js/script.js"></script>
</div>
</body>
</html>
